Repository: devangpadhiyar/django-validators
Catalog: djangovalidators/locale/*/LC_MESSAGES/django.po
Languages: fr

# ALPHA_REQUIRED
source: Only letters and dash accepted
fr: Merci de saisir uniquement lettres et tirets

# ALPHA_SPACE_REQUIRED
source: Only letters, spaces and dash accepted
fr: Merci de saisir uniquement lettres, tirets et espaces

# ALPHA_SPACE_QUOTE_REQUIRED
source: Only letters without accent, spaces, single quote and dash accepted
fr: Merci de saisir uniquement lettres, tirets, espaces et apostrophe simple

# ALPHANUM_REQUIRED
source: Only letters, numbers and dashes accepted
fr: Merci de saisir uniquement lettres, chiffres et tirets

# ALPHANUM_UNDERSCORE_REQUIRED
source: Only letters, numbers, underscores and dashes accepted
fr: Merci de saisir uniquement lettres, chiffres, tirets et sous-tirets

# ALPHANUM_SPACE_REQUIRED
source: Only letters, numbers, spaces and dashes accepted
fr: Merci de saisir uniquement lettres, chiffres, tirets et espaces

# ALPHANUM_SPACE_QUOTE_REQUIRED
source: Only letters, numbers, spaces, single quotes and dashes accepted
fr: Merci de saisir uniquement lettres, chiffres, tirets, espaces et apostrophe simple

# ALPHANUM_SPACE_QUOTE_UNDERSCORE_REQUIRED
source: Only letters, numbers, spaces, single quotes, underscores and dashes accepted
fr: Merci de saisir uniquement lettres, chiffres, tirets, espaces, apostrophe simple et sous-tirets

# LOCATION_NAME_VALIDATION
source: Only letters, numbers, dashes, spaces, and special characters accepted
fr: Merci de saisir uniquement lettres, chiffres, tirets, espaces, ou caractères spéciaux (.,)

# COMPANY_NAME_VALIDATION
source: At least one letter is required, numbers, dashes, spaces, and special characters accepted
fr: Merci de saisir uniquement lettres (au minimum une lettre), chiffres, tirets, espaces, ou caractères spéciaux ("!@#$%.,)

# COMPANY_IDCODE_VALIDATION
source: Only letters, numbers and spaces are accepted
fr: Merci de saisir uniquement lettres, chiffres et espaces

# SAFE_VALIDATION
source: Must not contain unsafe characters
fr: Ne doit pas contenir de caractères risqués

# FILENAME_VALIDATION
source: Filename must not contain those characters (<>:;,?"*|/)
fr: Le nom de fichier ne doit pas contenir ces caractères (<>:;,?"*|/)

# SAFETEXT_VALIDATION
source: Must not contain unsafe characters
fr: Ne doit pas contenir de caractères risqués
